## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_manifest.cinema-gateway will be created
+   resource "kubernetes_manifest" "cinema-gateway" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1alpha3"
+           kind       = "Gateway"
+           metadata   = {
+               name      = "website-gateway"
+               namespace = "cinema"
            }
+           spec       = {
+               selector = {
+                   istio = "ingressgateway"
                }
+               servers  = [
+                   {
+                       hosts = [
+                           "wayofthesys.com",
                        ]
+                       port  = {
+                           name     = "http"
+                           number   = 80
+                           protocol = "HTTP"
                        }
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1alpha3"
+           kind       = "Gateway"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "website-gateway"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               selector = {
+                   "istio" = "ingressgateway"
                }
+               servers  = [
+                   {
+                       bind            = (known after apply)
+                       defaultEndpoint = (known after apply)
+                       hosts           = [
+                           "wayofthesys.com",
                        ]
+                       name            = (known after apply)
+                       port            = {
+                           name       = "http"
+                           number     = 80
+                           protocol   = "HTTP"
+                           targetPort = (known after apply)
                        }
+                       tls             = {
+                           caCertificates        = (known after apply)
+                           cipherSuites          = (known after apply)
+                           credentialName        = (known after apply)
+                           httpsRedirect         = (known after apply)
+                           maxProtocolVersion    = (known after apply)
+                           minProtocolVersion    = (known after apply)
+                           mode                  = (known after apply)
+                           privateKey            = (known after apply)
+                           serverCertificate     = (known after apply)
+                           subjectAltNames       = (known after apply)
+                           verifyCertificateHash = (known after apply)
+                           verifyCertificateSpki = (known after apply)
                        }
                    },
                ]
            }
        }
    }

  # kubernetes_manifest.cinema-virtualservice will be created
+   resource "kubernetes_manifest" "cinema-virtualservice" {
+       manifest = {
+           apiVersion = "networking.istio.io/v1alpha3"
+           kind       = "VirtualService"
+           metadata   = {
+               name      = "website-ingress"
+               namespace = "cinema"
            }
+           spec       = {
+               gateways = [
+                   "website-gateway",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       route = [
+                           {
+                               destination = {
+                                   host = "website"
+                                   port = {
+                                       number = 80
                                    }
                                }
                            },
                        ]
                    },
                ]
            }
        }
+       object   = {
+           apiVersion = "networking.istio.io/v1alpha3"
+           kind       = "VirtualService"
+           metadata   = {
+               annotations                = (known after apply)
+               clusterName                = (known after apply)
+               creationTimestamp          = (known after apply)
+               deletionGracePeriodSeconds = (known after apply)
+               deletionTimestamp          = (known after apply)
+               finalizers                 = (known after apply)
+               generateName               = (known after apply)
+               generation                 = (known after apply)
+               labels                     = (known after apply)
+               managedFields              = (known after apply)
+               name                       = "website-ingress"
+               namespace                  = "cinema"
+               ownerReferences            = (known after apply)
+               resourceVersion            = (known after apply)
+               selfLink                   = (known after apply)
+               uid                        = (known after apply)
            }
+           spec       = {
+               exportTo = (known after apply)
+               gateways = [
+                   "website-gateway",
                ]
+               hosts    = [
+                   "wayofthesys.com",
                ]
+               http     = [
+                   {
+                       corsPolicy       = {
+                           allowCredentials = (known after apply)
+                           allowHeaders     = (known after apply)
+                           allowMethods     = (known after apply)
+                           allowOrigin      = (known after apply)
+                           allowOrigins     = (known after apply)
+                           exposeHeaders    = (known after apply)
+                           maxAge           = (known after apply)
                        }
+                       delegate         = {
+                           name      = (known after apply)
+                           namespace = (known after apply)
                        }
+                       fault            = {
+                           abort = {
+                               grpcStatus = (known after apply)
+                               http2Error = (known after apply)
+                               httpStatus = (known after apply)
+                               percentage = {
+                                   value = (known after apply)
                                }
                            }
+                           delay = {
+                               exponentialDelay = (known after apply)
+                               fixedDelay       = (known after apply)
+                               percent          = (known after apply)
+                               percentage       = {
+                                   value = (known after apply)
                                }
                            }
                        }
+                       headers          = {
+                           request  = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
+                           response = {
+                               add    = (known after apply)
+                               remove = (known after apply)
+                               set    = (known after apply)
                            }
                        }
+                       match            = (known after apply)
+                       mirror           = {
+                           host   = (known after apply)
+                           port   = {
+                               number = (known after apply)
                            }
+                           subset = (known after apply)
                        }
+                       mirrorPercent    = (known after apply)
+                       mirrorPercentage = {
+                           value = (known after apply)
                        }
+                       mirror_percent   = (known after apply)
+                       name             = (known after apply)
+                       redirect         = {
+                           authority    = (known after apply)
+                           derivePort   = (known after apply)
+                           port         = (known after apply)
+                           redirectCode = (known after apply)
+                           scheme       = (known after apply)
+                           uri          = (known after apply)
                        }
+                       retries          = {
+                           attempts              = (known after apply)
+                           perTryTimeout         = (known after apply)
+                           retryOn               = (known after apply)
+                           retryRemoteLocalities = (known after apply)
                        }
+                       rewrite          = {
+                           authority = (known after apply)
+                           uri       = (known after apply)
                        }
+                       route            = [
+                           {
+                               destination = {
+                                   host   = "website"
+                                   port   = {
+                                       number = 80
                                    }
+                                   subset = (known after apply)
                                }
+                               headers     = {
+                                   request  = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
+                                   response = {
+                                       add    = (known after apply)
+                                       remove = (known after apply)
+                                       set    = (known after apply)
                                    }
                                }
+                               weight      = (known after apply)
                            },
                        ]
+                       timeout          = (known after apply)
                    },
                ]
+               tcp      = (known after apply)
+               tls      = (known after apply)
            }
        }
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
